In [ ]:
from pandas.io import gbq   # for import data from Google BigQuery

In [ ]:
# preparation Google Cloud project for importing data from Google BigQuey
# Project Name    : My Project 94029
# Project ID      : metal-node-317815
# Project Number  : 675126865121

# function to import data from BigQuery
def read_query(query):
  return gbq.read_gbq(query, project_id="metal-node-317815")

# Introduction

The data retrieve from [Google BigQuery](https://console.cloud.google.com/marketplace/product/city-of-new-york/nyc-citi-bike)

In [ ]:
query_citibike_stations = """
SELECT * 
FROM `bigquery-public-data.new_york_citibike.citibike_stations`
LIMIT 2
"""

df1 = read_query(query_citibike_stations)
df1

   station_id                name  ... eightd_has_available_keys  last_reported
0         173  Broadway & W 49 St  ...                     False     1970-01-01
1         393   E 5 St & Avenue C  ...                     False     1970-01-01

[2 rows x 18 columns]

In [ ]:
query_citibike_trips = """
SELECT * 
FROM `bigquery-public-data.new_york_citibike.citibike_trips`
WHERE starttime >= '2015-01-01 00:00:00' AND starttime <= '2017-12-31 23:59:59'
LIMIT 2
"""

df2 = read_query(query_citibike_trips)
df2

   tripduration           starttime  ...  gender  customer_plan
0          1186 2015-12-30 13:02:38  ...  female
1           799 2017-09-02 16:27:37  ...    male

[2 rows x 16 columns]

# Matching Column Value

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_stations`, `bigquery-public-data.new_york_citibike.citibike_trips`
WHERE station_id = start_station_id 
      AND starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0         443               443               772
1        3244              3244               209
2         383               383               669
3         307               307               436

# Inner Join

The **INNER JOIN** keyword selects all rows from both the tables as long as the condition satisfies. This keyword will create the result-set by combining all rows from both the tables where the condition satisfies, i.e. value of common field will be same

`SELECT` table1.column1, table2.column2, table2.column1,...

`FROM` table1

`INNER JOIN` table2

`ON` table1.matching_column = table2.matching_column

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_trips` 
      INNER JOIN `bigquery-public-data.new_york_citibike.citibike_stations`
      ON station_id = start_station_id
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0         247               247               291
1        3497              3497              2567
2         347               347               649
3        3163              3163              1500

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_stations` 
      INNER JOIN `bigquery-public-data.new_york_citibike.citibike_trips`
      ON station_id = start_station_id
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0        3284              3284               743
1         387               387               531
2        2021              2021               286
3        3514              3514               468

# Left Join

The **LEFT JOIN** returns all the rows of the table on the left side of the join and matching rows for the table on the right side of join. The rows for which there is no matching row on right side, the result set will contain _null_. **LEFT JOIN** is also known as **LEFT OUTER**

`SELECT` table1.column1, table1.column2, table2.column1,...

`FROM` table1

`LEFT JOIN` table2

`ON` table1.matching_column = table2.matching_column

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_trips` 
      LEFT JOIN `bigquery-public-data.new_york_citibike.citibike_stations`
      ON station_id = start_station_id
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0         NaN              3431               381
1      3284.0              3284               743
2       387.0               387               531
3      2021.0              2021               286

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_stations` 
      LEFT JOIN `bigquery-public-data.new_york_citibike.citibike_trips`
      ON station_id = start_station_id
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0         503               503               363
1         321               321               886
2         369               369               980
3         341               341               890

# Right Join

The **RIGHT JOIN** is similar to LEFT JOIN, but this join returns all the rows of the table on the right side of the join and matching rows for the table on the left side of join. The rows for which there is no matching row on left side, the result-set will contain _null_. The **RIGHT JOIN** is also known as **RIGHT OUTER JOIN**

`SELECT` table1.column1, table2.column2, table2.column1,...

`FROM` table1

`RIGHT JOIN` table2

`ON` table1.matching_column = table2.matching_column

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_trips` 
      RIGHT JOIN `bigquery-public-data.new_york_citibike.citibike_stations`
      ON station_id = start_station_id
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0        3158              3158               414
1         291               291               614
2        3137              3137               849
3         537               537               722

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_stations` 
      RIGHT JOIN `bigquery-public-data.new_york_citibike.citibike_trips`
      ON station_id = start_station_id
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0         NaN              3431               381
1      3284.0              3284               743
2       387.0               387               531
3      2021.0              2021               286

# Full Join

The **FULL JOIN** creates the result-set by combining result of both LEFT JOIN and RIGHT JOIN. The result-set will contain all the rows from both the tables. The rows for which there is no matching, the result-set will contain _null_ values.

`SELECT` table1.column1, table1.column2, table2.column1,...

`FROM` table1

`FULL JOIN` table2

`ON` table1.matching_column = table2.matching_column

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_trips` 
      FULL JOIN `bigquery-public-data.new_york_citibike.citibike_stations`
      ON station_id = start_station_id
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0        3244              3244               330
1         341               341               763
2         432               432               438
3        3674              3674               995

In [ ]:
myquery = """
SELECT station_id, start_station_id, tripduration AS span_time_in_sec
FROM `bigquery-public-data.new_york_citibike.citibike_stations` 
      FULL JOIN `bigquery-public-data.new_york_citibike.citibike_trips`
      ON station_id = start_station_id
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
LIMIT 4
"""

df = read_query(myquery)
df

   station_id  start_station_id  span_time_in_sec
0         408               408               923
1         474               474               535
2         336               336               260
3         127               127               346

# New York: What are the most popular Citi Bike stations? 
Using data from [Google BigQuery](https://console.cloud.google.com/marketplace/product/city-of-new-york/nyc-citi-bike), find top 3 the most popular Citi Bike stations

In [ ]:
myquery = """
SELECT start_station_name, 
       start_station_latitude,
       start_station_longitude,
       COUNT(*) AS num_trips
FROM `bigquery-public-data.new_york.citibike_trips`
GROUP BY 1, 2, 3
ORDER BY num_trips DESC
LIMIT 3
"""

df = read_query(myquery)
df

      start_station_name  ...  num_trips
0     E 17 St & Broadway  ...     291615
1  Lafayette St & E 8 St  ...     277060
2        W 21 St & 6 Ave  ...     275348

[3 rows x 4 columns]

# New York Citi Bike Trips: What are the most popular routes by subscriber type?
Using data from [Google BigQuery](https://console.cloud.google.com/marketplace/product/city-of-new-york/nyc-citi-bike), find top 3 the most popular routes by subscriber type

In [ ]:
myquery = """
SELECT usertype, 
       CONCAT(start_station_name, " to ", end_station_name) as route, 
       COUNT(*) as num_trips,
       ROUND(AVG(cast(tripduration as int64) / 60),2) as duration
FROM `bigquery-public-data.new_york.citibike_trips`
WHERE usertype = 'Subscriber'
GROUP BY start_station_name, end_station_name, usertype
ORDER BY num_trips DESC
LIMIT 3
"""

df = read_query(myquery)
df

     usertype                                       route  num_trips  duration
0  Subscriber          W 21 St & 6 Ave to 9 Ave & W 22 St      11594      5.35
1  Subscriber         W 21 St & 6 Ave to W 22 St & 10 Ave      10451      6.95
2  Subscriber  E 7 St & Avenue A to Lafayette St & E 8 St       9639      5.59

# New York Citi Bike Trips: What are the top routes by gender? 
Using data from [Google BigQuery](https://console.cloud.google.com/marketplace/product/city-of-new-york/nyc-citi-bike), find top 3 routes by gender

In [ ]:
myquery = """
SELECT CONCAT(start_station_name, " to ", end_station_name) AS route,
       COUNT(*) AS num_trips
FROM `bigquery-public-data.new_york.citibike_trips`
WHERE gender = "female"
      AND CAST(starttime AS string) LIKE '2016%'
GROUP BY start_station_name,
         end_station_name
ORDER BY num_trips DESC
LIMIT 3
"""

df = read_query(myquery)
df

                                               route  num_trips
0                W 21 St & 6 Ave to W 22 St & 10 Ave        942
1  N 6 St & Bedford Ave to Wythe Ave & Metropolit...        905
2                 W 21 St & 6 Ave to 9 Ave & W 22 St        809

# Calculate the average trip duration per station on a monthly basis in 2018
Calculate the average trip duration per `start_station_id` on a monthly basis in 2018 -extracted from trips's starttime- and print the `station name`. Sort by month ascending and average trip duration descending, then only print the first 5 rows

In [ ]:
myquery = """
SELECT FORMAT_DATE("%Y-%m", starttime) AS month, 
       start_station_id, start_station_name,  
       ROUND(AVG(tripduration), 2) AS avg_trip_duration
FROM `bigquery-public-data.new_york_citibike.citibike_trips`
WHERE starttime >= '2018-01-01 00:00:00' AND starttime <= '2018-12-31 23:59:59'
GROUP BY month, start_station_id, start_station_name
ORDER BY month ASC, avg_trip_duration DESC
LIMIT 5
"""

df = read_query(myquery)
df

     month  start_station_id     start_station_name  avg_trip_duration
0  2018-01              3082    Hope St & Union Ave           44090.61
1  2018-01              3537  Carlton Ave & Dean St           34165.41
2  2018-01              3485      NYCBS Depot - RIS           20677.00
3  2018-01              3650           8D Mobile 01           17775.89
4  2018-01               501    FDR Drive & E 35 St            9635.16

# Find the most favorite start station and end station for male customers in 2017
Pull the most favorite start station and end station for male customers in 2017 -year filter extracted from trip's starttime

In [ ]:
myquery = """
SELECT gender, 
       start_station_name AS favorite_start_station, 
       end_station_name AS favorite_end_station
FROM `bigquery-public-data.new_york_citibike.citibike_trips`
WHERE starttime >= '2017-01-01 00:00:00' 
      AND starttime <= '2017-12-31 23:59:59' AND gender = 'male'
GROUP BY gender, favorite_start_station, favorite_end_station
ORDER BY COUNT(start_station_id) DESC, COUNT(end_station_id) DESC
LIMIT 1
"""

df = read_query(myquery)
df

  gender favorite_start_station    favorite_end_station
0   male      E 7 St & Avenue A  Cooper Square & E 7 St

# Show the top 3 stations with the most total trip duration each year
Pull the top 3 stations with the most total trip duration each year, between 2015 to 2018 -year filter extracted from trip's starttime. Sort by year ascending. For each year, rank these stations in the ascending order, with the 1st rank as the station with the most total trip duration

In [ ]:
myquery = """
SELECT year,
       station_name,
       total_trip_duration,
       rank
FROM (
      SELECT FORMAT_DATE("%Y", starttime) AS year,
             start_station_name AS station_name,
             SUM(tripduration) AS total_trip_duration,
             ROW_NUMBER() OVER (PARTITION BY FORMAT_DATE("%Y", starttime) 
                          ORDER BY SUM(tripduration) DESC) AS rank
      FROM `bigquery-public-data.new_york_citibike.citibike_trips`
      WHERE starttime >= '2015-01-01 00:00:00' 
            AND starttime <= '2018-12-31 23:59:59'
      GROUP BY starttime, start_station_name
      )
WHERE rank <= 3
ORDER BY year
"""

df = read_query(myquery)
df

    year                      station_name  total_trip_duration  rank
0   2015           Lexington Ave & E 24 St              5864661     1
1   2015           South St & Whitehall St              5174309     2
2   2015        Greenwich Ave & Charles St              3742976     3
3   2016             Fulton St & Grand Ave              6707533     1
4   2016          Vesey Pl & River Terrace              6177145     2
5   2016            Central Park S & 6 Ave              6053789     3
6   2017           Fulton St & Rockwell Pl              9735948     1
7   2017     Atlantic Ave & Fort Greene Pl              9582723     2
8   2017             Fulton St & Utica Ave              9340261     3
9   2018               Hope St & Union Ave             19510049     1
10  2018  Grand Army Plaza & Plaza St West             15962256     2
11  2018        Kingston Ave & Herkimer St             15020934     3

# Pivot Table: Flight Table

In [ ]:
myquery = """
SELECT airline, departure_airport, AVG(departure_delay)
FROM `bigquery-samples.airline_ontime_data.flights`
GROUP BY 1, 2
"""

df = read_query(myquery)
df.head(4)

  airline departure_airport       f0_
0      NW               BOS  5.649114
1      NW               JAC  4.636426
2      WN               BHM  8.494801
3      DL               SJU  2.809100

In [ ]:
myquery = """
SELECT airline, COUNT(airline) AS frequency
FROM `bigquery-samples.airline_ontime_data.flights`
GROUP BY airline
ORDER BY frequency DESC
LIMIT 6
"""

df = read_query(myquery)
df

  airline  frequency
0      WN   11723133
1      AA    6822440
2      DL    6607317
3      OO    5158971
4      UA    5043578
5      MQ    5020385

In [ ]:
myquery = """
SELECT * 
FROM (
  SELECT airline, departure_airport, departure_delay
  FROM `bigquery-samples.airline_ontime_data.flights`)
PIVOT (
  AVG(departure_delay) AS avg_delay
  FOR airline in ('WN', 'AA', 'DL', 'OO', 'UA', 'MQ'))
"""

df = read_query(myquery)
df.head(4)

  departure_airport  avg_delay_WN  ...  avg_delay_UA  avg_delay_MQ
0               HNL           NaN  ...      4.806615           NaN
1               OKC      7.338191  ...      1.777040      9.765432
2               BHM      8.494801  ...           NaN      9.564232
3               TUS      7.241627  ...      3.389318     -0.394254

[4 rows x 7 columns]

# Pivot Table: Stackoverflow user

In [ ]:
myquery = """
SELECT tag, EXTRACT(YEAR FROM creation_date) AS year, COUNT(tags) AS frequency
FROM `bigquery-public-data.stackoverflow.posts_questions`, 
      UNNEST(SPLIT(tags, '|')) AS tag
WHERE tags IS NOT null
GROUP BY 1, 2
ORDER BY year DESC, frequency DESC
"""

df = read_query(myquery)
df.head(4)

          tag  year  frequency
0      python  2021     135538
1  javascript  2021      96506
2        java  2021      49836
3     reactjs  2021      43359

In [ ]:
myquery = """
SELECT *
FROM (
  SELECT tag, EXTRACT(YEAR FROM creation_date) AS year
  FROM `bigquery-public-data.stackoverflow.posts_questions`, 
        UNNEST(SPLIT(tags, '|')) AS tag)
PIVOT (
  COUNT (*) AS frequency
  FOR year IN (2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020))
"""

df = read_query(myquery)
df.head(4)

                    tag  frequency_2011  ...  frequency_2019  frequency_2020
0              lighttpd             124  ...              36              34
1                   vba            3651  ...           22285           19357
2                 ocaml             401  ...             533             479
3  hidden-markov-models              24  ...              37              37

[4 rows x 11 columns]